//  Напишите программу, которая на вход принимает два числа и проверяет, является ли первое квадратом второго

Console.WriteLine("Проверка, является ли число 1 квадратом числа 2");

int number1 = int.Parse(Console.ReadLine());
int number2 = int.Parse(Console.ReadLine());

Console.WriteLine("Пожалуйста, введите число 1");
int number1 = Console.ReadLine();

Console.WriteLine("Пожалуйста, введите число 2");
int number2 = Console.ReadLine();

if (number1 = number2 * number2)
{
Console.WriteLine("Первое число является квадратом второго");
}

else 
{
Console.WriteLine("Первое число НЕ является квадратом второго");
}